import React from 'react';
import { motion } from 'framer-motion';

// Define the ServiceCard component
const ServiceCard = ({ icon, title, description }) => {
  return (
    <motion.div
      className="w-1/5 h-auto bg-[#E6E9DB] px-8 py-10 flex flex-col items-end justify-center mx-4 transition-transform duration-300 ease-in-out hover:scale-105 hover:bg-[#D1D8C4]"
      initial={{ opacity: 0, y: 20 }}
      whileInView={{ opacity: 1, y: 0 }}
      transition={{ duration: 0.5, ease: "easeOut" }}
      viewport={{ once: true }}
    >
      <div>{icon}</div>
      <p className="py-2 text-[var(--font-color)] font-bold text-2xl">{title}</p>
      <p className="text-gray-600 font-bold text-xl text-right">{description}</p>
    </motion.div>
  );
};

// Define the Services component
const Services = () => {
  const servicesData = [
    {
      icon: (
        <svg width="77" height="77" viewBox="0 0 77 70" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M50.0418 26.1698L38.5187 70L27.269 26.1698H50.0418ZM49.2706 22.108L38.5 2.01056L27.7294 22.108H49.2706ZM77 22.108L66.2332 2.01056L55.4626 22.108H77ZM62.9799 0H41.7533L52.3516 19.8091L62.9799 0ZM35.2467 0H14.0201L24.6484 19.8091L35.2467 0ZM10.7668 2.03087L0 22.108H21.5374L10.7668 2.03087ZM0.79366 26.1698L34.4082 69.1186L23.368 26.1698H0.79366ZM42.6742 69.013L76.2063 26.1698H53.9352L42.6742 69.013Z" fill="#259F88" />
        </svg>
      ),
      title: "قيمنا",
      description: " العمل جنبًا إلى جنب مع الشركاء والمجتمعا",
    },
    {
      icon: (
        <svg width="77" height="77" viewBox="0 0 73 79" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M23.6074 5.69434C23.4951 5.27726 23.2385 4.92441 22.8855 4.69981L16.5013 0.737751C15.7474 0.272501 14.7528 0.513162 14.2876 1.26704L0.235779 23.9971C0.0112864 24.366 -0.0529411 24.7991 0.0432882 25.2161C0.139534 25.6171 0.396236 25.9861 0.765145 26.2107L7.14939 30.1567C7.40609 30.3172 7.69483 30.3974 7.98355 30.3974C8.52899 30.3974 9.0422 30.1246 9.34699 29.6273L23.3988 6.89741C23.6234 6.54456 23.7036 6.09536 23.6074 5.69434ZM36.6486 30.1246C39.4879 30.1246 42.0705 31.2314 43.9633 33.0601L48.0056 26.5154C48.4708 25.7615 48.2462 24.767 47.4923 24.3018L25.0029 10.4104L13.2129 29.483L26.4788 37.696C27.794 33.3168 31.8524 30.1246 36.6486 30.1246ZM65.3458 41.4014L48.8718 31.2155L46.0486 35.7871C46.8346 37.2628 47.2838 38.9632 47.2838 40.7597C47.2838 41.9468 47.0913 43.0857 46.7224 44.1444L58.9775 51.7157C59.2342 51.8762 59.523 51.9563 59.8117 51.9563C60.3571 51.9563 60.8703 51.6996 61.1751 51.2024L65.8591 43.599C66.3243 42.8611 66.0997 41.8666 65.3458 41.4014ZM72.1953 47.4007L68.6342 45.2031C68.6181 45.2352 68.5861 45.2833 68.5701 45.3154L63.9021 52.8866C63.8861 52.9187 63.8701 52.9348 63.838 52.9669L67.399 55.1645C67.6557 55.3249 67.9445 55.4051 68.2332 55.4051C68.7786 55.4051 69.2918 55.1324 69.5966 54.6512L72.7086 49.6143C73.1738 48.8605 72.9492 47.8659 72.1953 47.4007Z" fill="#259F88" />
          <path d="M38.3186 62.0212V48.4937C41.6354 47.755 44.1318 44.8058 44.1318 41.2707C44.1318 37.1927 40.8085 33.8438 36.7049 33.8438C32.6038 33.8438 29.294 37.2406 29.294 41.2707C29.294 44.8126 31.7872 47.7679 35.1104 48.4994V62.0212L23.8097 75.3725C23.2379 76.0485 23.3226 77.0604 23.9977 77.633C24.6751 78.2051 25.6863 78.1216 26.2597 77.445L35.1104 66.9877V76.4088C35.1104 77.2946 35.8279 78.0129 36.7145 78.0129C37.6011 78.0129 38.3186 77.2946 38.3186 76.4088V66.988L47.1677 77.445C47.7395 78.1202 48.7499 78.2079 49.4297 77.633C50.1049 77.0612 50.1895 76.0485 49.6177 75.3725L38.3186 62.0212Z" fill="#259F88" />
        </svg>
      ),
      title: "رؤيتنا",
      description: "بناء مجتمع قوي و تقديم الدعم  الفوري ",
    },
    {
      icon: (
        <svg width="77" height="77" viewBox="0 0 80 58" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M76.3693 0H3.63067C2.16 0 1.93867 0.692 3.13867 1.544L38.0573 26.3267C39.1293 27.4253 40.8707 27.4253 41.9427 26.3267L76.8613 1.544C78.0613 0.692 77.84 0 76.3693 0Z" fill="#259F88" />
          <path d="M80 6.86801V52.5347C80 55.2947 77.76 57.5347 75 57.5347H5C2.24 57.5347 0 55.2947 0 52.5347V6.86801C0 5.39601 0.970667 4.89868 2.16667 5.75601L38.0573 31.516C39.1293 32.616 40.8707 32.616 41.9427 31.516L77.8333 5.75601C79.0293 4.89868 80 5.39601 80 6.86801Z" fill="#259F88" />
        </svg>
      ),
      title: "رسالتنا",
      description: "نسعى  إلى تعزيز العدالة الاجتماعية والمساواة"
    },
  ];

  return (
    <div className='bg-[var(--primary-bg-color)] w-full h-auto flex items-center justify-center py-16'>
      {servicesData.map((service, index) => (
        <ServiceCard
          key={index}
          icon={service.icon}
          title={service.title}
          description={service.description}
        />
      ))}
    </div>
  );
};

export default Services;
